000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TEST.
000300 AUTHOR. RAM.
000400 INSTALLATION. ROTTWEIL.
000500 DATE-WRITTEN. 11-12-2025.
000600 DATE-COMPILED.
000700 SECURITY. UNCLASSIFIED.
000800 ENVIRONMENT DIVISION.
000900 CONFIGURATION SECTION.
001000 SOURCE-COMPUTER. RAMSTATION.
001100 OBJECT-COMPUTER. RAMSTATION.
001200 INPUT-OUTPUT SECTION.
001300     FILE-CONTROL.
001400     SELECT MY-FILE-IN ASSIGN TO MYIN.
001500     SELECT REPORT1-FILE-OUT ASSIGN TO REPORT1
001600     FILE STATUS IS REPORT1-STATUS-CODE.
001700 DATA DIVISION.
001800 FILE SECTION.
001900 FD  MY-FILE-IN
002000     LABEL RECORDS ARE STANDARD
002100     RECORDING MODE IS F
002200     RECORD CONTAINS 100 CHARACTERS.
002300     BLOCK CONTAINS 0 RECORDS.
002400     DATA RECORD IS MY-RECORD.
002500     01 MY-RECORD PICTURE X(100).
002600 WORKING-STORAGE SECTION.
002700*Temporary variables